[
  {
    "id": 1,
    "answers": [
      {
        "id": 1,
        "questionId": 1,
        "postTime": "2023-04-24 12:00",
        "user": {
          "id": 8,
          "name": "Valentina Stepanova",
          "email": "valentina@mail.ru",
          "phone": "+79113234570",
          "birthDate": "1990-01-25",
          "city": "Нижний Новгород",
          "aboutSelf": "Я работала в больнице психиатрии, но затем решила уйти в частную практику. Сейчас занимаюсь психологическим консультированием и коучингом.",
          "role": "psychologist",
          "diploma": true,
          "helper": true,
          "rating": 240,
          "numAnswers": 17,
          "experienceYears": 6,
          "photo": "lib/data/photos/8.jpg"
        },
        "rating": 14,
        "text": "Для начала стоит выяснить, что именно вызывает конфликты в отношениях с вами и вашим родственником. Попробуйте сесть и поговорить наедине, чтобы высказать свои чувства и услышать со стороны взгляд друг на друга. Важно понимать, что каждый имеет право на свою точку зрения, и попытаться найти компромиссное решение, которое будет удовлетворительно для обеих сторон."
      },
      {
        "id": 2,
        "questionId": 1,
        "postTime": "2023-04-26 12:30",
        "user": {
          "id": 2,
          "name": "Maria Smirnova",
          "email": "maria@mail.ru",
          "phone": "+79112234567",
          "birthDate": "1985-08-07",
          "city": "Санкт-Петербург",
          "aboutSelf": "Я занимаюсь бегом и йогой. Люблю изучать культуру разных стран.",
          "role": "basicUser",
          "diploma": false,
          "helper": true,
          "rating": 0,
          "numAnswers": 2,
          "experienceYears": 0,
          "photo": "lib/data/photos/2.jpg"
        },
        "rating": 0,
        "text": "Ничего не изменить"

      },
      {
        "id": 3,
        "questionId": 1,
        "postTime": "2023-04-26 14:00",
        "user": {
          "id": 3,
          "name": "Alexey Kuznetsov",
          "email": "alexey@mail.ru",
          "phone": "+79113234567",
          "birthDate": "1995-02-15",
          "city": "Нижний Новгород",
          "aboutSelf": "Я работаю учителем и обожаю путешествовать на машине. Люблю читать книги по психологии.",
          "role": "basicUser",
          "diploma": false,
          "helper": true,
          "rating": 0,
          "numAnswers": 0,
          "experienceYears": 0,
          "photo": "lib/data/photos/3.jpg"
        },
        "rating": 10,
        "text": "Можно попробовать поставить себя на место родственника и понять, откуда могут исходить его действия и мысли. Иногда это помогает лучше понять причины конфликтов и научиться к ним более спокойно относится. Нужно стремиться к терпению, в целом, и искать точки соприкосновения, чтобы найти решения, с которыми будут согласны обе стороны"
      },
      {
        "id": 4,
        "questionId": 1,
        "postTime": "2023-04-26 22:00",
        "user": {
          "id": 4,
          "name": "Elena Petrova",
          "email": "elena@mail.ru",
          "phone": "+79114234567",
          "birthDate": "1980-11-27",
          "city": "Екатеринбург",
          "aboutSelf": "Я занимаюсь стрит-воркаутом и готовлю вегетарианские блюда. Работаю журналистом.",
          "role": "basicUser",
          "diploma": false,
          "helper": true,
          "rating": 17,
          "numAnswers": 6,
          "experienceYears": 0,
          "photo": "lib/data/photos/4.jpg"
        },
        "rating": 0,
        "text": "Я тоже часто конфликтую с братом, но мы нашли путь улаживать разногласия. Когда нам интересно что-то обсудить, мы договариваемся, что никто в процессе не будет перебивать друг друга. Это помогает нам выслушивать аргументы друг друга и находить компромиссные решения"

      }
    ]
  },
  {
    "id": 2,
    "answers": [
      {
        "id": 1,
        "questionId": 2,
        "postTime": "2022-02-01 12:00",
        "user": {
          "id": 10,
          "name": "Anton Kirsanov",
          "email": "anton_kirsanov@mail.ru",
          "phone": "+79115234572",
          "birthDate": "1989-03-08",
          "city": "Казань",
          "aboutSelf": "Я работаю психологом и провожу групповые тренинги по развитию личности. Ранее работал в сфере рекламы. Очень увлекаюсь исследованиями в области психологии и философии.",
          "role": "psychologist",
          "diploma": true,
          "helper": true,
          "rating": 190,
          "numAnswers": 25,
          "experienceYears": 8,
          "photo": "lib/data/photos/10.jpg"
        },
        "rating": 6,
        "text": "Чтобы научиться откладывать работу в сторону и не погружаться в нее с головой, необходимо осознать свои приоритеты и границы. Важно установить конкретные цели и разбить их на мелкие задачи, которые можно выполнять постепенно. Также стоит выделить время для отдыха и личного времени, и не откладывать его на последний момент. Не стоит слишком сильно сосредотачиваться на работе и забывать о других важных аспектах жизни, таких как отношения с близкими людьми, здоровье и хобби. Важно научиться не бояться делегировать задачи, чтобы иметь возможность посвятить время другим аспектам жизни. Наконец, не забывайте профессиональную помощь, если вы чувствуете, что не можете справиться с работой, границами или стрессом на своей работе."
      }
    ]
  }
]